In [1]:
import pandas as pd

In [2]:
#Q1.
data = {
'Name' : ['Alice', 'Bob', 'Claire', 'David', 'Emma'],
'Age': [25, 30, 27, 22, 28],
'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
'Salary': [50000, 60000, 55000, 45000, 70000],
'Department': ['HR', 'IT', 'HR', 'IT', 'Finance']
}
df = pd.DataFrame(data)

In [4]:
# Function-1
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Gender      5 non-null      object
 3   Salary      5 non-null      int64
 4   Department  5 non-null      object
dtypes: int64(2), object(3)
memory usage: 328.0+ bytes
None

In [5]:
#Function-2
print(df.describe())

            Age        Salary
count   5.00000      5.000000
mean   26.40000  56000.000000
std     3.04959   9617.692031
min    22.00000  45000.000000
25%    25.00000  50000.000000
50%    27.00000  55000.000000
75%    28.00000  60000.000000
max    30.00000  70000.000000

In [8]:
#Function-3
grouped_data = df.groupby('Department').agg({'Age':'mean', 'Salary':'mean'})
print(grouped_data)

             Age   Salary
Department
Finance     28.0  70000.0
HR          26.0  52500.0
IT          26.0  52500.0

In [9]:
#Function-4
df.pivot_table(index='Gender', columns='Department', values=['Age', 'Salary'], aggfunc='mean')

               Age               Salary
Department Finance    HR    IT  Finance       HR       IT
Gender
Female        28.0  26.0   NaN  70000.0  52500.0      NaN
Male           NaN   NaN  26.0      NaN      NaN  52500.0

In [11]:
#Function-5
df.head()

     Name  Age  Gender  Salary Department
0   Alice   25  Female   50000         HR
1     Bob   30    Male   60000         IT
2  Claire   27  Female   55000         HR
3   David   22    Male   45000         IT
4    Emma   28  Female   70000    Finance

In [13]:
#Q2.

data = {
'A':[10,20,30,40,50],
'B':[100,200,300,400,500],
'C':[1000,2000,3000,4000,5000]
}

df1 = pd.DataFrame(data)

In [19]:
def new_index(row_number):
    return row_number * 2 + 1

df1 = df1.reset_index(drop=True)
df1.index = df1.index.to_series().apply(new_index)
print(df1)

    A    B     C
1  10  100  1000
3  20  200  2000
5  30  300  3000
7  40  400  4000
9  50  500  5000

In [20]:
#Q3.

data = {
'Values':[10,20,30,40,50]
}

df2 = pd.DataFrame(data)

In [27]:
def calculate_sum_first_three(df2):
    values_column = df2['Values']
    sum_first_three = values_column.head(3).sum()
    print("Sum of the first three values:", sum_first_three)

In [28]:
calculate_sum_first_three(df2)

Sum of the first three values: 60

In [30]:
#Q4.

data = {
'Text':['This is a sample text','Another Example','A third sentence']
}

df3 = pd.DataFrame(data)

In [36]:
def add_word_count_column(df3):
    df3['Word Count'] = df3['Text'].apply(lambda text : len(text.split()))
    return df3

In [37]:
df3_with_word_count = add_word_count_column(df3)
print(df3_with_word_count)

                    Text  Word Count
0  This is a sample text           5
1        Another Example           2
2       A third sentence           3

In [41]:
#Q5.

#1. 'DataFrame.size' 
# Returns the total number of elements in the DataFrame.
# It multiples rows with columns and gives the o/p.

#2. 'DataFrame.shape'
# Returns a tuple representing the dimensions of the DataFrame as (rows,columns)
# shape[0] represents the number of rows.
# shape[1] represents the number of columns.

In [42]:
#Q6.

#df = pd.read_excel('filename.xlsx')

In [8]:
#Q7.

import pandas as pd

data = {
'Email':['john.doe@example.com','jane.smith@example.com','mark.johnson@example.com']
}

df4 = pd.DataFrame(data)

def extract_name(email):
    return email.split('@')[0]

df4['Username'] = df4['Email'].apply(extract_name)

print(df4)

                      Email      Username
0      john.doe@example.com      john.doe
1    jane.smith@example.com    jane.smith
2  mark.johnson@example.com  mark.johnson

In [10]:
#Q8.

data = {
'A':[3,8,6,2,9],
'B':[5,2,9,3,1],
'C':[1,7,4,5,2]
}

df5 = pd.DataFrame(data)

In [12]:
def select_rows(df5):
    selected_rows = df5[(df5['A'] > 5) & (df5['B'] < 10)]
    return selected_rows

selected_df = select_rows(df5)
print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [13]:
#Q9.

data = {
'Values':[10, 20, 30, 40, 50]
}

df6 = pd.DataFrame(data)

In [14]:
def calculate_stats(df6):
    mean_value = df6['Values'].mean()
    median_value = df6['Values'].median()
    std_value = df6['Values'].std()
    
    return mean_value, median_value, std_value

mean, median, std = calculate_stats(df6)

print("Mean:", mean)
print("Median", median)
print("Standard Deviation", std)

Mean: 30.0
Median 30.0
Standard Deviation 15.811388300841896

In [16]:
#Q10.

data = {
'Sales':[100, 150, 200, 120, 180, 160, 220, 250, 190, 230, 210, 270, 240, 280],
'Date': pd.date_range(start='2023-08-17', periods=14)
}

df7 = pd.DataFrame(data)

In [20]:
def calculate_moving_average(df7):
    df7['Moving Average'] = df7['Sales'].rolling(window=7, min_periods=1).mean()
    
calculate_moving_average(df7)

print(df7)

    Sales       Date  Moving Average
0     100 2023-08-17      100.000000
1     150 2023-08-18      125.000000
2     200 2023-08-19      150.000000
3     120 2023-08-20      142.500000
4     180 2023-08-21      150.000000
5     160 2023-08-22      151.666667
6     220 2023-08-23      161.428571
7     250 2023-08-24      182.857143
8     190 2023-08-25      188.571429
9     230 2023-08-26      192.857143
10    210 2023-08-27      205.714286
11    270 2023-08-28      218.571429
12    240 2023-08-29      230.000000
13    280 2023-08-30      238.571429

In [21]:
#Q11.

data ={
'Date':['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']
}

df8 = pd.DataFrame(data)

In [25]:
def add_weekday_column(df8):
    df8['Date'] = pd.to_datetime(df8['Date'])
    
    df8['Weekday'] = df8['Date'].dt.strftime('%A')
    
    return df8

modified_df8 = add_weekday_column(df8)
print(df8)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [26]:
#Q12.

data = {
'Date':['2023-01-01', '2023-01-15', '2023-02-10', '2023-01-20']
}

df9 = pd.DataFrame(data)

In [27]:
df9

         Date
0  2023-01-01
1  2023-01-15
2  2023-02-10
3  2023-01-20

In [30]:
def select_rows_between_dates(df9):
    
    df9['Date'] = pd.to_datetime(df9['Date'])
    
    selected_rows = df9[(df9['Date'] >= '2023-01-01') & (df9['Date'] <= '2023-01-31')]
    return selected_rows

selected_df = select_rows_between_dates(df9)
print(selected_df)

        Date
0 2023-01-01
1 2023-01-15
3 2023-01-20

In [31]:
#Q13.

# It is the following library that needs to be imported to use the basic functions of pandas.

import pandas as pd

In [32]:
# End